<?php
// Инициализация массива названий стран
$a[]="Австрия";
$a[]="Австралия";
$a[]="Аргентина";
$a[]="Беларусь";
$a[]="Бельгия";
$a[]="Болгария";
$a[]="Бразилия";
$a[]="Венгрия";
$a[]="Германия";
$a[]="Голандия";
$a[]="Греция";
$a[]="Дания";
$a[]="Египет";
$a[]="Индия";
$a[]="Италия";
$a[]="Испания";
$a[]="Китай";
$a[]="Куба";
$a[]="Латвия";
$a[]="Литва";
$a[]="Польша";
$a[]="Россия";
$a[]="Румыния";
$a[]="Сербия";
$a[]="Словакия";
$a[]="США";
$a[]="Тайланд";
$a[]="Тунис";
$a[]="Турция";
$a[]="Финляндия";
$a[]="Чехия";
$a[]="Швеция";

//получение параметра s из URL
$s = preg_replace("/[\. \(\)\-]/", "", $_REQUEST['s']);
$s = iconv("UTF-8", "WINDOWS-1251", $s);

$response="";

if (strlen($s) > 0)
{
	for($i = 0; $i<count($a); $i++)
  	{
  		if (strtolower($s) == strtolower(substr($a[$i],0,strlen($s))))
    	{
    		if ($response == "")
      		{
      			$response=$a[$i];
      		}
    		else
      		{
      			$response=$response." , ".$a[$i];
      		}
    	}
  	}
}

$response=iconv("WINDOWS-1251", "UTF-8", $response);
//вывод результата
echo $response;
?>